# Importing necessary libraries

In [694]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns

# Loading dataset

In [862]:
df= pd.read_excel("flight_price.xlsx")

# Checking Data Structure

In [865]:
df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

In [867]:
df.shape

(10683, 11)

# Bacic Informatin about dataset

In [699]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Dep_Time         10683 non-null  object
 6   Arrival_Time     10683 non-null  object
 7   Duration         10683 non-null  object
 8   Total_Stops      10682 non-null  object
 9   Additional_Info  10683 non-null  object
 10  Price            10683 non-null  int64
dtypes: int64(1), object(10)
memory usage: 918.2+ KB

# Descriptive Statistics of numerical columns

In [701]:
df.describe()

              Price
count  10683.000000
mean    9087.064121
std     4611.359167
min     1759.000000
25%     5277.000000
50%     8372.000000
75%    12373.000000
max    79512.000000

# Cleaning the dataset

## Handling null values

In [704]:
 df.isnull().sum()

Airline            0
Date_of_Journey    0
Source             0
Destination        0
Route              1
Dep_Time           0
Arrival_Time       0
Duration           0
Total_Stops        1
Additional_Info    0
Price              0
dtype: int64

In [705]:
df.dropna(inplace = True)

In [706]:
df.isna().sum().sum()

0

## Checking for duplicates

In [708]:
df.duplicated().sum()

220

## Removing duplicates

In [710]:
df.drop_duplicates(inplace = True)

In [711]:
df.duplicated().sum()

0

# Feature Engineering

## Creating date, month and year columns

In [714]:
df['Date']=df['Date_of_Journey'].str.split('/').str[0]
df['Month']=df['Date_of_Journey'].str.split('/').str[1]
df['Year']=df['Date_of_Journey'].str.split('/').str[2]

In [715]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10462 entries, 0 to 10682
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10462 non-null  object
 1   Date_of_Journey  10462 non-null  object
 2   Source           10462 non-null  object
 3   Destination      10462 non-null  object
 4   Route            10462 non-null  object
 5   Dep_Time         10462 non-null  object
 6   Arrival_Time     10462 non-null  object
 7   Duration         10462 non-null  object
 8   Total_Stops      10462 non-null  object
 9   Additional_Info  10462 non-null  object
 10  Price            10462 non-null  int64
 11  Date             10462 non-null  object
 12  Month            10462 non-null  object
 13  Year             10462 non-null  object
dtypes: int64(1), object(13)
memory usage: 1.2+ MB

In [716]:
# Changing data types of date related columns
df['Date']=df['Date'].astype(int)
df['Month']=df['Month'].astype(int)
df['Year']=df['Year'].astype(int)

In [717]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10462 entries, 0 to 10682
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10462 non-null  object
 1   Date_of_Journey  10462 non-null  object
 2   Source           10462 non-null  object
 3   Destination      10462 non-null  object
 4   Route            10462 non-null  object
 5   Dep_Time         10462 non-null  object
 6   Arrival_Time     10462 non-null  object
 7   Duration         10462 non-null  object
 8   Total_Stops      10462 non-null  object
 9   Additional_Info  10462 non-null  object
 10  Price            10462 non-null  int64
 11  Date             10462 non-null  int32
 12  Month            10462 non-null  int32
 13  Year             10462 non-null  int32
dtypes: int32(3), int64(1), object(10)
memory usage: 1.1+ MB

In [718]:
df.drop('Date_of_Journey',axis = 1,inplace = True)

In [719]:
df.head(2)

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897,24,3,2019
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662,1,5,2019

## Arrival Time

In [721]:
df['Arrival_Time'] = df['Arrival_Time'].apply(lambda x:x.split(' ')[0])
df['Arrival_Hour']=df['Arrival_Time'].str.split(':').str[0]
df['Arrival_Minute']=df['Arrival_Time'].str.split(':').str[1]

In [722]:
df['Arrival_Hour']=df['Arrival_Hour'].astype(int)
df['Arrival_Minute']=df['Arrival_Minute'].astype(int)

In [723]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10462 entries, 0 to 10682
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10462 non-null  object
 1   Source           10462 non-null  object
 2   Destination      10462 non-null  object
 3   Route            10462 non-null  object
 4   Dep_Time         10462 non-null  object
 5   Arrival_Time     10462 non-null  object
 6   Duration         10462 non-null  object
 7   Total_Stops      10462 non-null  object
 8   Additional_Info  10462 non-null  object
 9   Price            10462 non-null  int64
 10  Date             10462 non-null  int32
 11  Month            10462 non-null  int32
 12  Year             10462 non-null  int32
 13  Arrival_Hour     10462 non-null  int32
 14  Arrival_Minute   10462 non-null  int32
dtypes: int32(5), int64(1), object(9)
memory usage: 1.1+ MB

In [724]:
df.drop('Arrival_Time',axis = 1, inplace = True)

In [725]:
df.head(2)

,Airline,Source,Destination,Route,Dep_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_Hour,Arrival_Minute
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,2h 50m,non-stop,No info,3897,24,3,2019,1,10
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,7h 25m,2 stops,No info,7662,1,5,2019,13,15

# Departure Time

In [727]:
df['Dep_Hour']=df['Dep_Time'].str.split(':').str[0]
df['Dep_Minute']=df['Dep_Time'].str.split(':').str[1]

In [728]:
df['Dep_Hour']=df['Dep_Hour'].astype(int)
df['Dep_Minute']=df['Dep_Minute'].astype(int)

In [729]:
df.drop('Dep_Time',axis = 1, inplace =True)

In [730]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10462 entries, 0 to 10682
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10462 non-null  object
 1   Source           10462 non-null  object
 2   Destination      10462 non-null  object
 3   Route            10462 non-null  object
 4   Duration         10462 non-null  object
 5   Total_Stops      10462 non-null  object
 6   Additional_Info  10462 non-null  object
 7   Price            10462 non-null  int64
 8   Date             10462 non-null  int32
 9   Month            10462 non-null  int32
 10  Year             10462 non-null  int32
 11  Arrival_Hour     10462 non-null  int32
 12  Arrival_Minute   10462 non-null  int32
 13  Dep_Hour         10462 non-null  int32
 14  Dep_Minute       10462 non-null  int32
dtypes: int32(7), int64(1), object(7)
memory usage: 1021.7+ KB

In [731]:
df.head(2)

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_Hour,Arrival_Minute,Dep_Hour,Dep_Minute
0,IndiGo,Banglore,New Delhi,BLR → DEL,2h 50m,non-stop,No info,3897,24,3,2019,1,10,22,20
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,7h 25m,2 stops,No info,7662,1,5,2019,13,15,5,50

# Total Stops

In [733]:
df.Total_Stops.unique()

array(['non-stop', '2 stops', '1 stop', '3 stops', '4 stops'],
      dtype=object)

In [734]:
df['Total_Stops'] = df['Total_Stops'].map({'non-stop':0,'2 stops':2,'1 stop':1,'3 stops':3,'4 stops':4})

In [735]:
df['Total_Stops']=df['Total_Stops'].astype(int)

In [736]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10462 entries, 0 to 10682
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10462 non-null  object
 1   Source           10462 non-null  object
 2   Destination      10462 non-null  object
 3   Route            10462 non-null  object
 4   Duration         10462 non-null  object
 5   Total_Stops      10462 non-null  int32
 6   Additional_Info  10462 non-null  object
 7   Price            10462 non-null  int64
 8   Date             10462 non-null  int32
 9   Month            10462 non-null  int32
 10  Year             10462 non-null  int32
 11  Arrival_Hour     10462 non-null  int32
 12  Arrival_Minute   10462 non-null  int32
 13  Dep_Hour         10462 non-null  int32
 14  Dep_Minute       10462 non-null  int32
dtypes: int32(8), int64(1), object(6)
memory usage: 980.8+ KB

In [737]:
df.head(2)

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_Hour,Arrival_Minute,Dep_Hour,Dep_Minute
0,IndiGo,Banglore,New Delhi,BLR → DEL,2h 50m,0,No info,3897,24,3,2019,1,10,22,20
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,7h 25m,2,No info,7662,1,5,2019,13,15,5,50

# Duration

In [739]:
df['Duration_Hour']=df['Duration'].str.split(' ').str[0].str.split("h").str[0]
df['Duration_Minute']=df['Duration'].str.split(' ').str[1].str.split("m").str[0]

In [740]:
df['Duration_Hour'].unique()

array(['2', '7', '19', '5', '4', '15', '21', '25', '13', '12', '26', '22',
       '23', '20', '10', '6', '11', '8', '16', '3', '27', '1', '14', '9',
       '18', '17', '24', '30', '28', '29', '37', '34', '38', '35', '36',
       '47', '33', '32', '31', '42', '39', '5m', '41', '40'], dtype=object)

In [741]:
df['Duration_Hour']=df['Duration_Hour'].str.split('m').str[0]

In [742]:
df['Duration_Hour']=df['Duration_Hour'].astype(int)

In [743]:
df['Duration_Minute'].unique()

array(['50', '25', nan, '45', '30', '5', '15', '35', '10', '20', '55',
       '40'], dtype=object)

In [744]:
# Here null value is because of having no minutes (e:g '2h' --> nan , '2h 10m' --> 10)

In [745]:
df.fillna({'Duration_Minute':0},inplace = True)

In [746]:
df['Duration_Minute']=df['Duration_Minute'].astype(int)

In [747]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10462 entries, 0 to 10682
Data columns (total 17 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10462 non-null  object
 1   Source           10462 non-null  object
 2   Destination      10462 non-null  object
 3   Route            10462 non-null  object
 4   Duration         10462 non-null  object
 5   Total_Stops      10462 non-null  int32
 6   Additional_Info  10462 non-null  object
 7   Price            10462 non-null  int64
 8   Date             10462 non-null  int32
 9   Month            10462 non-null  int32
 10  Year             10462 non-null  int32
 11  Arrival_Hour     10462 non-null  int32
 12  Arrival_Minute   10462 non-null  int32
 13  Dep_Hour         10462 non-null  int32
 14  Dep_Minute       10462 non-null  int32
 15  Duration_Hour    10462 non-null  int32
 16  Duration_Minute  10462 non-null  int32
dtypes: int32(10), int64(1), object(6)
memory usage: 1.0+ MB

In [748]:
df.head(2)

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_Hour,Arrival_Minute,Dep_Hour,Dep_Minute,Duration_Hour,Duration_Minute
0,IndiGo,Banglore,New Delhi,BLR → DEL,2h 50m,0,No info,3897,24,3,2019,1,10,22,20,2,50
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,7h 25m,2,No info,7662,1,5,2019,13,15,5,50,7,25

In [749]:
df.drop(['Duration','Additional_Info','Route'],axis=1,inplace = True)

In [750]:
df.head(2)

,Airline,Source,Destination,Total_Stops,Price,Date,Month,Year,Arrival_Hour,Arrival_Minute,Dep_Hour,Dep_Minute,Duration_Hour,Duration_Minute
0,IndiGo,Banglore,New Delhi,0,3897,24,3,2019,1,10,22,20,2,50
1,Air India,Kolkata,Banglore,2,7662,1,5,2019,13,15,5,50,7,25

In [751]:
df['Airline'].unique()

array(['IndiGo', 'Air India', 'Jet Airways', 'SpiceJet',
       'Multiple carriers', 'GoAir', 'Vistara', 'Air Asia',
       'Vistara Premium economy', 'Jet Airways Business',
       'Multiple carriers Premium economy', 'Trujet'], dtype=object)

In [752]:
df['Source'].unique()

array(['Banglore', 'Kolkata', 'Delhi', 'Chennai', 'Mumbai'], dtype=object)

In [753]:
df['Destination'].unique()

array(['New Delhi', 'Banglore', 'Cochin', 'Kolkata', 'Delhi', 'Hyderabad'],
      dtype=object)

In [754]:
from sklearn.preprocessing import OneHotEncoder

In [755]:
encoder = OneHotEncoder(handle_unknown = 'ignore',sparse_output=False)

In [824]:
encoded_array = encoder.fit_transform(df[['Airline','Source','Destination']]).astype(int)

In [826]:
encoded_array.shape

(10462, 23)

In [828]:
encoded_df = pd.DataFrame(encoded_array,columns = encoder.get_feature_names_out())

In [830]:
encoded_df.head(2)

,Airline_Air Asia,Airline_Air India,Airline_GoAir,Airline_IndiGo,Airline_Jet Airways,Airline_Jet Airways Business,Airline_Multiple carriers,Airline_Multiple carriers Premium economy,Airline_SpiceJet,Airline_Trujet,...,Source_Chennai,Source_Delhi,Source_Kolkata,Source_Mumbai,Destination_Banglore,Destination_Cochin,Destination_Delhi,Destination_Hyderabad,Destination_Kolkata,Destination_New Delhi
0,0,0,0,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
1,0,1,0,0,0,0,0,0,0,0,...,0,0,1,0,1,0,0,0,0,0

In [850]:
final_df = pd.concat([df,encoded_df],axis = 1)

In [852]:
final_df.head(2)

,Airline,Source,Destination,Total_Stops,Price,Date,Month,Year,Arrival_Hour,Arrival_Minute,...,Source_Chennai,Source_Delhi,Source_Kolkata,Source_Mumbai,Destination_Banglore,Destination_Cochin,Destination_Delhi,Destination_Hyderabad,Destination_Kolkata,Destination_New Delhi
0,IndiGo,Banglore,New Delhi,0.0,3897.0,24.0,3.0,2019.0,1.0,10.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
1,Air India,Kolkata,Banglore,2.0,7662.0,1.0,5.0,2019.0,13.0,15.0,...,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0

In [854]:
final_df.drop(['Airline','Destination','Source'],axis =1,inplace = True)

In [856]:
final_df.head()

,Total_Stops,Price,Date,Month,Year,Arrival_Hour,Arrival_Minute,Dep_Hour,Dep_Minute,Duration_Hour,...,Source_Chennai,Source_Delhi,Source_Kolkata,Source_Mumbai,Destination_Banglore,Destination_Cochin,Destination_Delhi,Destination_Hyderabad,Destination_Kolkata,Destination_New Delhi
0,0.0,3897.0,24.0,3.0,2019.0,1.0,10.0,22.0,20.0,2.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
1,2.0,7662.0,1.0,5.0,2019.0,13.0,15.0,5.0,50.0,7.0,...,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
2,2.0,13882.0,9.0,6.0,2019.0,4.0,25.0,9.0,25.0,19.0,...,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
3,1.0,6218.0,12.0,5.0,2019.0,23.0,30.0,18.0,5.0,5.0,...,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
4,1.0,13302.0,1.0,3.0,2019.0,21.0,35.0,16.0,50.0,4.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0

In [858]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10671 entries, 0 to 10453
Data columns (total 34 columns):
 #   Column                                     Non-Null Count  Dtype
---  ------                                     --------------  -----
 0   Total_Stops                                10462 non-null  float64
 1   Price                                      10462 non-null  float64
 2   Date                                       10462 non-null  float64
 3   Month                                      10462 non-null  float64
 4   Year                                       10462 non-null  float64
 5   Arrival_Hour                               10462 non-null  float64
 6   Arrival_Minute                             10462 non-null  float64
 7   Dep_Hour                                   10462 non-null  float64
 8   Dep_Minute                                 10462 non-null  float64
 9   Duration_Hour                              10462 non-null  float64
 10  Duration_Minute                            10462 non-null  float64
 11  Airline_Air Asia                           10462 non-null  float64
 12  Airline_Air India                          10462 non-null  float64
 13  Airline_GoAir                              10462 non-null  float64
 14  Airline_IndiGo                             10462 non-null  float64
 15  Airline_Jet Airways                        10462 non-null  float64
 16  Airline_Jet Airways Business               10462 non-null  float64
 17  Airline_Multiple carriers                  10462 non-null  float64
 18  Airline_Multiple carriers Premium economy  10462 non-null  float64
 19  Airline_SpiceJet                           10462 non-null  float64
 20  Airline_Trujet                             10462 non-null  float64
 21  Airline_Vistara                            10462 non-null  float64
 22  Airline_Vistara Premium economy            10462 non-null  float64
 23  Source_Banglore                            10462 non-null  float64
 24  Source_Chennai                             10462 non-null  float64
 25  Source_Delhi                               10462 non-null  float64
 26  Source_Kolkata                             10462 non-null  float64
 27  Source_Mumbai                              10462 non-null  float64
 28  Destination_Banglore                       10462 non-null  float64
 29  Destination_Cochin                         10462 non-null  float64
 30  Destination_Delhi                          10462 non-null  float64
 31  Destination_Hyderabad                      10462 non-null  float64
 32  Destination_Kolkata                        10462 non-null  float64
 33  Destination_New Delhi                      10462 non-null  float64
dtypes: float64(34)
memory usage: 2.8 MB